4.1 판다스 패키지 소개

In [2]:
import pandas as pd

시리즈 = 값 + 인덱스

In [16]:
s = pd.Series([10000, 20000, 30000, 40000, 50000],
              index = ["서울", "인천", "부산", "대전", "세종"])
b = pd.Series(range(10,14))
b

0    10
1    11
2    12
3    13
dtype: int64

In [17]:
s.index
s.values

array([10000, 20000, 30000, 40000, 50000], dtype=int64)

In [18]:
s.name = "라벨"
s.index.name = "도시"
s

도시
서울    10000
인천    20000
부산    30000
대전    40000
세종    50000
Name: 라벨, dtype: int64

In [19]:
s / 10000

도시
서울    1.0
인천    2.0
부산    3.0
대전    4.0
세종    5.0
Name: 라벨, dtype: float64

In [23]:
s[1], s["부산"]
s[3], s["세종"]
s[[0,3,2]]
s[1:3]

도시
인천    20000
부산    30000
Name: 라벨, dtype: int64

데이터프레임

In [52]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" : [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005  2010-2015 증가율
서울  수도권  9904312  9631482  9853972         0.0283
부산  경상권  3448737  3393191  3655437         0.0163
인천  수도권  2890451  2632035  2466338         0.0982
대구  경상권  2466052  2431774  2473990         0.0141

In [53]:
df.values

array([['수도권', 9904312, 9631482, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2473990, 0.0141]], dtype=object)

In [54]:
df.columns.name = "특성"
df.index.name = "도시"
df

특성   지역     2015     2010     2005  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9853972         0.0283
부산  경상권  3448737  3393191  3655437         0.0163
인천  수도권  2890451  2632035  2466338         0.0982
대구  경상권  2466052  2431774  2473990         0.0141

In [55]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df #갱신

특성   지역     2015     2010     2005  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9853972           2.83
부산  경상권  3448737  3393191  3655437           1.63
인천  수도권  2890451  2632035  2466338           9.82
대구  경상권  2466052  2431774  2473990           1.41

In [56]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9853972           2.83          -2.26
부산  경상권  3448737  3393191  3655437           1.63          -7.17
인천  수도권  2890451  2632035  2466338           9.82           6.72
대구  경상권  2466052  2431774  2473990           1.41          -1.71

In [57]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9853972          -2.26
부산  경상권  3448737  3393191  3655437          -7.17
인천  수도권  2890451  2632035  2466338           6.72
대구  경상권  2466052  2431774  2473990          -1.71

열 단위 인덱싱 (하나씩 해도 무방)

In [58]:
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [59]:
df[["지역"]]

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [72]:
df[["2005", "2010"]]

특성     2005     2010
도시
서울  9853972  9631482
부산  3655437  3393191
인천  2466338  2632035
대구  2473990  2431774

행 단위 인덱싱 (항상 슬라이싱을 해야함)

In [64]:
df[:1]

특성   지역     2015     2010     2005  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9853972          -2.26

In [62]:
df["부산":"인천"]

특성   지역     2015     2010     2005  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3655437          -7.17
인천  수도권  2890451  2632035  2466338           6.72

In [65]:
df["2015"]["서울"]

9904312

In [86]:
data2 = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df2 = pd.DataFrame(data2, index=index, columns=columns)
df2

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [87]:
df2[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [88]:
df2["과목 평균 점수"] = ((df2["국어"] + df2["영어"] + df2["수학"]) / 3).round(1)
df2

    국어  영어  수학  과목 평균 점수
춘향  80  90  90      86.7
몽룡  90  70  60      73.3
향단  70  60  80      70.0
방자  30  40  70      46.7

In [91]:
df2["영어"]["방자"] = 80
df2["영어"]["방자"]

C:\Users\SKW\AppData\Local\Temp\ipykernel_17972\783866147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["영어"]["방자"] = 80

80

In [93]:
df2[0:1]

    국어  영어  수학  과목 평균 점수
춘향  80  90  90      86.7

In [95]:
df2.T["춘향"] #시리즈는 열라벨로만 가능하기 때문에 df2.T를 해준 모습

국어          80.0
영어          90.0
수학          90.0
과목 평균 점수    86.7
Name: 춘향, dtype: float64

4.2 데이터 입출력

> CSV 파일 입력

>>CSV 파일 포맷은 데이터 값이 쉽표(comma)로 구분되는 텍스트 파일이다.

In [1]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [5]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [6]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample2.csv

In [8]:
pd.read_csv('sample2.csv', names=['c1', 'c2', 'c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [9]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [11]:
pd.read_csv('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

pd.read_csv('파일이름', 명령=)
- names는 인수 지정
- index_col은 특정한 열을 인덱스로 지정
- sep은 구분자지정
- skiprows는 건너 뛰어야할 행 지정
- na_values=[값]은 특정 값을 NaN값으로

>인터넷 상의 CSV파일 입력

In [17]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [21]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

>인터넷 상의 데이터 베이스 자료 입력

In [24]:
import datetime
dt_start = datetime.datetime(2015, 1, 1)
dt_end = "2016, 6, 30"

In [29]:
import pandas_datareader as pdr
gdp = pdr.get_data_fred('GDP', dt_start, dt_end)
gdp.tail()

                  GDP
DATE
2015-04-01  18279.784
2015-07-01  18401.626
2015-10-01  18435.137
2016-01-01  18525.933
2016-04-01  18711.702

In [30]:
inflation = pdr.get_data_fred(["CPIAUCSL", "CPILFESL"], dt_start, dt_end)
inflation.tail()

            CPIAUCSL  CPILFESL
DATE
2016-02-01   237.336   245.510
2016-03-01   238.080   245.913
2016-04-01   238.992   246.551
2016-05-01   239.557   247.137
2016-06-01   240.222   247.540

4.3 데이터프레임 고급 인덱싱

- loc : 라벨값 기반의 2차원 인덱싱 >> df.loc[행 인덱싱값, 열 인덱싱값]

- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [33]:
import numpy as np
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [49]:
df.loc["a"]
# df.loc["A"]  # KeyError

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [35]:
df.loc["b":"c"]
# df[["b", "c"]]  # KeyError

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [36]:
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [37]:
df.loc[["b","c"]] #리스트를 뽑을거면 loc를 써야한다.

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [38]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [39]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [54]:
def select_rows(df):
    return df.A > 0


df.loc[select_rows(df)]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [50]:
df.loc["a", "A"]

10

In [52]:
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int32

In [53]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [55]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [59]:
df.iloc[0, 1]

11

In [61]:
df.iloc[0]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [57]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [62]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [63]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [64]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [73]:
import pandas as pd
data_5 = {
    "A" : [1, 2, 3, 4, 5],
    "B" : [2, 4, 6, 8, 10],
    "C" : [1, 3, 5, 7, 9],
    "D" : [1, 4, 9, 16, 25],
    "E" : [3, 6, 9, 12, 15]
}
columns = ["A", "B", "C", "D", "E"]
index = ["1st", "2nd", "3rd", "4th", "5th"]
df = pd.DataFrame(data_5, index=index, columns=columns)
df = df.T
df

   1st  2nd  3rd  4th  5th
A    1    2    3    4    5
B    2    4    6    8   10
C    1    3    5    7    9
D    1    4    9   16   25
E    3    6    9   12   15

In [77]:
df.loc["A", "1st"]

1

4.4 데이터프레임의 데이터 조작

> 데이터 갯수 세기

In [78]:
# 데이터 갯수 세기 count 메서드 이용
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [79]:
s.count() #NaN 값은 세지 않음

9

In [80]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [81]:
df.count() #데이터 프레임에서는 각 열마다 개수를 셈

0    4
1    4
2    4
3    3
dtype: int64

> 카테고리 값 세기

In [82]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [83]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [86]:
df[0].value_counts() # 데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용해야 한다.

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

> 정렬

In [87]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [88]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [95]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [96]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

>행/열 합계

In [97]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [98]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [99]:
df2.sum(axis=0)

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [100]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [101]:
df2.loc["ColTotal", :] = df2.sum(axis=0)
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

>apply 변환

- 고급 행/열 연산처리

In [102]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [103]:
df3.apply(lambda x: x.max() - x.min(), axis = 0) #행합계 = 열방향 합계 / 열합계 = 행방향 합계

A    3
B    2
C    4
dtype: int64

In [104]:
df3.apply(lambda x: x.max() - x.min(), axis = 1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [112]:
# 각 열에 대해 어떤 값이 얼마나 사용되었는지 알고 싶다면 value_counts 함수를 넣으면 된다.
df3_modi = df3.apply(pd.value_counts).round(0).fillna(-1) #.round(0).astype(int) -> 소수점 없애주면서 정보손실까지 막아줌, .fillna(-1) -> NaN 값을 바꿔줌
df3_modi = df3_modi.astype(int)
df3_modi = df3_modi.replace(-1, np.nan)
df3_modi #실패 ㅠㅠ

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [119]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [122]:
titanic["category1"] = titanic.apply(lambda i: i.sex if i.age > 20 else 'child', axis = 1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

>fillna 매서드

In [123]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [126]:
titanic.fillna({"age": round(float(titanic['age'].mean()),1)}, inplace = True)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [127]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [130]:
df3.apply(pd.value_counts).fillna(0).astype(int).replace(0,"NaN")

     A    B    C
1    1    1    1
2  NaN    2    1
3    2    2  NaN
4    2  NaN    2
5  NaN  NaN    1

4.5 데이터프레임 인덱스 조작

In [4]:
import numpy as np
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [5]:
df2 = df1.set_index("C1")
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [6]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [7]:
df2.reset_index(drop=True) #중요한 것 같음

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

>행 인덱스와 열 인덱스 교환

In [10]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [12]:
df4.stack("Cidx2")

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [14]:
df4.unstack("Ridx1")

Cidx1     A                       B
Cidx2     C           D           C           D
Ridx1     F     M     F     M     F     M     F     M
Ridx2
id_1   0.76  1.76  0.12  0.40  0.44  0.98  0.33  2.24
id_2   1.49  1.87 -0.21 -0.98  0.31  0.95 -0.85 -0.15
id_3  -2.55 -0.10  0.65  0.41  0.86  0.14 -0.74  1.45

4.6 데이터프레임 합성

>merge 함수를 사용한 데이터프레임 병합

In [23]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [24]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [25]:
pd.merge(df1, df2) #두 데이터 프레임에 키가 존재하는 데이터만 inner join

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [29]:
pd.merge(df1, df2, how='outer').fillna("-")

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너         -
4  1003   또치         -
5  1004   길동         -
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희         -
9  1008    -  100000.0

In [30]:
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [31]:
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [34]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})

df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})

pd.merge(df1, df2, on='고객명')

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

4.7 피봇테이블과 그룹분석

In [ ]:
#df.pivot("행 인덱스 인수", "열 인덱스 인수", "데이터")
#df.pivot(["행 인덱스 인수1", "행 인덱스 인수2"]], "열 인덱스 인수", "데이터")

4.8 시계열 자료 다루기

In [35]:
date_str = ["2018, 1, 1", "2018, 1, 4", "2018, 1, 5", "2018, 1, 6"]
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2018-01-01', '2018-01-04', '2018-01-05', '2018-01-06'], dtype='datetime64[ns]', freq=None)

In [36]:
np.random.seed(0)
s = pd.Series(np.random.randn(4), index=idx)
s

2018-01-01    1.764052
2018-01-04    0.400157
2018-01-05    0.978738
2018-01-06    2.240893
dtype: float64

In [37]:
pd.date_range("2018-4-1", "2018-4-30")

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

s: 초

T: 분

H: 시간

D: 일(day)

B: 주말이 아닌 평일

W: 주(일요일)

W-MON: 주(월요일)

M: 각 달(month)의 마지막 날

MS: 각 달의 첫날

BM: 주말이 아닌 평일 중에서 각 달의 마지막 날

BMS: 주말이 아닌 평일 중에서 각 달의 첫날

WOM-2THU: 각 달의 두번째 목요일

Q-JAN: 각 분기의 첫달의 마지막 날

Q-DEC: 각 분기의 마지막 달의 마지막 날

In [38]:
pd.date_range("2018-4-1", "2018-4-30", freq="B")

DatetimeIndex(['2018-04-02', '2018-04-03', '2018-04-04', '2018-04-05',
               '2018-04-06', '2018-04-09', '2018-04-10', '2018-04-11',
               '2018-04-12', '2018-04-13', '2018-04-16', '2018-04-17',
               '2018-04-18', '2018-04-19', '2018-04-20', '2018-04-23',
               '2018-04-24', '2018-04-25', '2018-04-26', '2018-04-27',
               '2018-04-30'],
              dtype='datetime64[ns]', freq='B')